## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 5 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api"
        tags                           = {}
        # (24 unchanged attributes hidden)



      ~ vpc_config {
          ~ security_group_ids = [
              - "sg-0f9735f4a80772634",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # aws_network_acl_rule.ephemeral_ports will be created
  + resource "aws_network_acl_rule" "ephemeral_ports" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = "acl-0c4834fc7eb8190bb"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 111
      + to_port        = 65535
    }

  # aws_network_acl_rule.ephemeral_ports_egress will be created
  + resource "aws_network_acl_rule" "ephemeral_ports_egress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = "acl-0c4834fc7eb8190bb"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 111
      + to_port        = 65535
    }

  # aws_network_acl_rule.https will be created
  + resource "aws_network_acl_rule" "https" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = "acl-0c4834fc7eb8190bb"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 443
    }

  # aws_network_acl_rule.https_egress will be created
  + resource "aws_network_acl_rule" "https_egress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = "acl-0c4834fc7eb8190bb"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 443
    }

  # aws_security_group.api will be created
  + resource "aws_security_group" "api" {
      + arn                    = (known after apply)
      + description            = "SG for the API lambda"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "scan-websites_api_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "scan-websites-production"
          + "Name"       = "scan-websites_api_sg"
        }
      + tags_all               = {
          + "CostCentre" = "scan-websites-production"
          + "Name"       = "scan-websites_api_sg"
        }
      + vpc_id                 = "vpc-095a761b6add80a7b"
    }

  # module.rds.aws_security_group.rds_proxy will be updated in-place
  ~ resource "aws_security_group" "rds_proxy" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = null
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 5432
            },
        ]
        id                     = "sg-0f9735f4a80772634"
        name                   = "scan-websites_rds_proxy_sg"
        tags                   = {
            "CostCentre" = "scan-websites-production"
            "Name"       = "scan-websites_rds_proxy_sg"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>